; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	spectrograph4 - mode
	spectrograph5 - mode
	image2 - mode
	infrared1 - mode
	spectrograph3 - mode
	image0 - mode
	Star3 - direction
	Star4 - direction
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image2)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph5)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 image2)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star4)
	(supports instrument4 spectrograph4)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 Star0)
	(supports instrument5 image2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
	(supports instrument6 image0)
	(calibration_target instrument6 Star2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
)
(:goal (and
	(pointing satellite0 Planet9)
	(pointing satellite1 Planet6)
	(pointing satellite3 Phenomenon5)
	(have_image Phenomenon5 infrared1)
	(have_image Planet6 image2)
	(have_image Star7 infrared1)
	(have_image Star7 spectrograph4)
	(have_image Planet8 spectrograph4)
	(have_image Planet8 infrared1)
	(have_image Planet9 spectrograph5)
	(have_image Planet9 infrared1)
))

)

; plan
1. (turn_to satellite3 phenomenon5 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 phenomenon5)
   goals met: 1 of 11
2. (turn_to satellite2 star4 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star4)
   goals met: 1 of 11
3. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 11
4. (calibrate satellite2 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 1 of 11
5. (turn_to satellite2 phenomenon5 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 phenomenon5)
   goals met: 1 of 11
6. (turn_to satellite1 star3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star3)
   goals met: 1 of 11
7. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 11
8. (take_image satellite2 phenomenon5 instrument3 infrared1)
   added: (have_image phenomenon5 infrared1)
   goals met: 2 of 11
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 11
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 11
11. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 2 of 11
12. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 2 of 11
13. (turn_to satellite0 planet9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet9)
   goals met: 3 of 11
14. (take_image satellite0 planet9 instrument1 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 4 of 11
15. (take_image satellite0 planet9 instrument1 spectrograph5)
   added: (have_image planet9 spectrograph5)
   goals met: 5 of 11
16. (turn_to satellite1 planet6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet6)
   goals met: 6 of 11
17. (take_image satellite1 planet6 instrument2 image2)
   added: (have_image planet6 image2)
   goals met: 7 of 11
18. (turn_to satellite2 planet8 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet8)
   goals met: 7 of 11
19. (take_image satellite2 planet8 instrument3 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 8 of 11
20. (take_image satellite2 planet8 instrument3 spectrograph4)
   added: (have_image planet8 spectrograph4)
   goals met: 9 of 11
21. (turn_to satellite2 star7 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star7)
   goals met: 9 of 11
22. (take_image satellite2 star7 instrument3 infrared1)
   added: (have_image star7 infrared1)
   goals met: 10 of 11
23. (take_image satellite2 star7 instrument3 spectrograph4)
   added: (have_image star7 spectrograph4)
   goals met: 11 of 11
